:PROPERTIES:
:ID:       f784abeb-900f-4c13-85f5-f449ee545c20
:END:
#+title: js-oop-defineProperties()
#+date: [2024-08-05 一]
#+last_modified:  

* Object.defineProperties(obj, mpProp)


#+BEGIN_SRC js :noweb yes :results output
let book = {}

Object.defineProperties(book, {
    year_: {
      value: 2017
    },
    edition: {
      value: 1
    },
    year:{
      get() {
        return this.year_ // convention private prop
      },
      set(newValue) {
        if (newValue > 2014) {
          this.year_ = newValue
	  this.edition += newValue - 2017
        }
      }
    }
  }
)

book.year = 2018
console.log(book.edition)
#+END_SRC

#+RESULTS:
: 1

*Note*
- All attr of props is false default

* See Also
- [[id:a6a73334-0382-4108-abd6-a187febb51d3][js-oop-defineProperty()]]
